Repository: felipecerinzasick/blog
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, hi

source: About
de: Über

source: Advance search
de: Fortgeschrittene Suche
hi: आधुनिक खोज

source: All Rights Reserved
de: Alle Rechte vorbehalten

source: Community driven
de: Kollaboration

source: Dashoard
de: Dashboard

source: Designed with care
de: mit Sorgfalt entworfen

source: English
de: Englisch
hi: अंग्रेज़ी

source: Find, Engage and Convert traffic online
de: Neuer Zündstoff für den Einzelhandel
hi: ऑनलाइन ट्रैफ़िक ढूंढें, संलग्न करें और कनवर्ट करें

source: Focused action
de: Tatendrang

source: Get Started
de: Jetzt starten

source: Get started
de: Jetzt starten

source: Get the latest insights about effective online strategies, tools and much more!
de: Trage dich ein um über die letzten Anpassungen und Strategien zu erfahren.

source: Home
de: Start

source: In development
de: Focussiert

source: Inisghts oriented
de: Kontinuierliche Verbesserung

source: Join Our Newsletter
de: Immer auf dem Laufenden bleiben.

source: Logout
de: Abmelden

source: New Post
de: Neuer Post

source: Privacy policy
de: Datenschutz-Bestimmungen (in Bearbeitung)

source: Profile
de: Profil

source: Register
de: Registrieren

source: Search
de: Suche
hi: खोज

source: Sick Leads aims at providing relevant data for business decision making.
de: Sick Leads zielt darauf ab, relevante Daten für die Entscheidungsfindung im Unternehmen bereitzustellen.

source: Sick Leads gets things done. In less time at reduced cost.
de: Sick Leads erledigt die Dinge. In kürzerer Zeit zu reduzierten Kosten.

source: Sick Leads helps you find, engage and convert new customers online. It's your companion that offers you tools, a community of like-minded people and strategies to help you generate more business online. Start leveraging your web traffic and boost conversions today.
de: Sick Leads hilft Ihnen, neue Kunden online zu finden, zu binden und zu konvertieren. Es ist Ihr Begleiter, der Ihnen Tools, eine Gemeinschaft von Gleichgesinnten und Strategien bietet, die Ihnen helfen, mehr Online-Geschäft zu generieren. Beginnen Sie noch heute mit der Nutzung Ihres Web-Traffics und steigern Sie die Conversions.

source: Sick Leads is changing and evolving. Exciting things are coming.
de: Sick Leads verändert sich und entwickelt sich weiter. Spannende Dinge sind am Horizont.

source: Smart people working and collaborating together. True team spirit.
de: Intelligente Menschen, die zusammenarbeiten und zusammenarbeiten. Echter Teamgeist.

source: Subscriptions
de: Abonnements
hi: सदस्यता

source: Terms of service
de: Nutzungsbedingungen

source: The start of a great journey!
de: Der Beginn einer großartigen Reise!

source: View my posts
de: Meinen Post lesen
hi: मेरी पोस्ट देखें

source: With Strategies, Tools and a winning community.
de: Kunden im Internet finden und akquirieren: Mit System
hi: रणनीतियों, उपकरणों और एक विजेता समुदाय के साथ

source: Hindi
hi: हिंदी

source: Moderation queue
hi: मॉडरेशन कतार

source: Sick Leads
hi: बीमार सुराग
